import { getGlobalCached } from '@/lib/cachedGlobals'
import { GLOBAL_FOOTER_SLUG_AND_TAG } from '@/lib/constants'
import { pageHref } from '@/lib/utils'
import { GlobalFooter } from '@/payload-types'
import Image from 'next/image'
import Link from 'next/link'
import LocalizedHighlighted from './LocalizedHighlighted'
import LocalizedText from './LocalizedText'

async function Footer() {
  const shurjoPayData = [
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/1.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/2.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/3.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/4.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/5.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/6.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/7.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/8.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/9.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/10.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/11.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/12.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/13.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/14.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/15.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/16.png`,
    },
    {
      image: `${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/17.png`,
    },
  ]

  // const payloadConfig = await config
  // const payload = await getPayload({ config: payloadConfig })

  // const footer = await payload.findGlobal({
  //   slug: GLOBAL_FOOTER_SLUG_AND_TAG,
  // })
  // ⬇️ Cached global fetch (tag: global:global-footer)
  const footer = await getGlobalCached<GlobalFooter>(GLOBAL_FOOTER_SLUG_AND_TAG, 1) // depth=1 is enough for logo relation url
  return (
    <>
      {footer && (
        <div className="h-[420px] xl:h-[452px] 2xl:h-[572px] relative font-avenir ">
          {/* <div className="bg-[url('/assets/footerbg.png')] bg-cover bg-center bg-no-repeat h-full w-full z-0"></div> */}
          <div className="absolute inset-0 bg-[#3A3A3C] z-10"></div>
          <div
            className="absolute bottom-0 inset-x-0 text-white/70  text-center z-10 bg-[#FFFFFF21] 
      py-5 2xl:py-6 
      global-p2 md:font-medium"
          >
            {/* Copyright © 2025 <span className="text-[#FF6600]">Shanta Life Insurance PLC.</span> All
        Rights Reserved */}
            <LocalizedHighlighted
              textEn={footer?.copyright}
              textBn={footer?.copyrightBN}
              highlightEn={footer?.copyrightHighlightedText}
              highlightBn={footer?.copyrightHighlightedTextBN}
              className="mx-1"
            />
          </div>

          <div
            className="absolute inset-0 z-30
       p-2 lg:px-8 xl:px-12 2xl:px-32
       lg:py-12 xl:py-16 2xl:py-24 
       grid grid-cols-1 lg:grid-cols-8
       gap-x-2 text-white/70"
          >
            {/* grid 1  */}
            {/* <div className="flex flex-col space-y-6 p-2 col-span-3 lg:col-span-2"> */}
            <div className="flex flex-col space-y-6 p-2 lg:py-5 -mt-16 md:-mt-12 lg:mt-0 lg:col-span-2">
              {/* logo */}
              {/* 1.48 / 1 */}
              <div
                // h-[60px] md:h-[80px] lg:h-[100px] 2xl:h-[150px]
                className="relative
               w-[60px] md:w-[80px] lg:w-[100px] 2xl:w-[150px] mx-auto lg:mx-0 
               aspect-[1.48/1]"
              >
                {typeof footer?.branding?.logo === 'object' && footer?.branding?.logo?.url && (
                  <Image
                    // src={`${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/footer2.png`}
                    src={footer?.branding?.logo?.url}
                    fill
                    alt="footer logo"
                    className="object-contain object-center"
                    sizes="200px"
                    placeholder="blur"
                    blurDataURL={footer?.branding?.logoBlurDataURL || ''}
                    quality={80}
                  />
                )}
              </div>
              {/* <div className="lg:hidden w-full h-[1px] bg-white"></div> */}
              <div className="grid grid-cols-3 lg:grid-cols-1 gap-x-2 lg:space-y-3 md:px-4 md:py-2 lg:p-0">
                {/* social media 1*/}
                <div className="flex items-center space-x-2">
                  <div className="block w-[20px] lg:w-[30px] 2xl:w-[40px] h-[20px] lg:h-[30px] 2xl:h-[40px]">
                    <svg
                      // width="40"
                      // height="40"
                      viewBox="0 0 40 40"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                      <path
                        d="M27.8417 17.2004C27.8417 17.2004 27.8417 17.2004 27.8417 17.1588C27.2546 15.5556 26.1892 14.1715 24.7897 13.1936C23.3901 12.2158 21.724 11.6914 20.0167 11.6914C18.3095 11.6914 16.6434 12.2158 15.2438 13.1936C13.8443 14.1715 12.7789 15.5556 12.1917 17.1588C12.1917 17.1588 12.1917 17.1588 12.1917 17.2004C11.536 19.0095 11.536 20.9914 12.1917 22.8004C12.1917 22.8004 12.1917 22.8004 12.1917 22.8421C12.7789 24.4452 13.8443 25.8294 15.2438 26.8072C16.6434 27.7851 18.3095 28.3095 20.0167 28.3095C21.724 28.3095 23.3901 27.7851 24.7897 26.8072C26.1892 25.8294 27.2546 24.4452 27.8417 22.8421C27.8417 22.8421 27.8417 22.8421 27.8417 22.8004C28.4975 20.9914 28.4975 19.0095 27.8417 17.2004ZM13.5501 21.6671C13.2611 20.5748 13.2611 19.4261 13.5501 18.3338H15.1001C14.9668 19.4409 14.9668 20.56 15.1001 21.6671H13.5501ZM14.2334 23.3338H15.4001C15.5957 24.077 15.8753 24.7955 16.2334 25.4754C15.4162 24.9187 14.733 24.1871 14.2334 23.3338ZM15.4001 16.6671H14.2334C14.7258 15.8163 15.4002 15.085 16.2084 14.5254C15.8589 15.2065 15.5877 15.9249 15.4001 16.6671ZM19.1667 26.4171C18.1432 25.666 17.4244 24.5715 17.1417 23.3338H19.1667V26.4171ZM19.1667 21.6671H16.7834C16.6279 20.5614 16.6279 19.4394 16.7834 18.3338H19.1667V21.6671ZM19.1667 16.6671H17.1417C17.4244 15.4294 18.1432 14.3349 19.1667 13.5838V16.6671ZM25.7667 16.6671H24.6001C24.4045 15.9239 24.1249 15.2054 23.7667 14.5254C24.584 15.0822 25.2672 15.8137 25.7667 16.6671ZM20.8334 13.5838C21.8569 14.3349 22.5758 15.4294 22.8584 16.6671H20.8334V13.5838ZM20.8334 26.4171V23.3338H22.8584C22.5758 24.5715 21.8569 25.666 20.8334 26.4171ZM23.2167 21.6671H20.8334V18.3338H23.2167C23.3723 19.4394 23.3723 20.5614 23.2167 21.6671ZM23.7917 25.4754C24.1499 24.7955 24.4295 24.077 24.6251 23.3338H25.7917C25.2922 24.1871 24.609 24.9187 23.7917 25.4754ZM26.4501 21.6671H24.9001C24.9679 21.1141 25.0013 20.5575 25.0001 20.0004C25.001 19.4433 24.9676 18.8867 24.9001 18.3338H26.4501C26.7391 19.4261 26.7391 20.5748 26.4501 21.6671Z"
                        fill="white"
                      />
                    </svg>
                  </div>
                  <div className="text-[11px] md:text-xs 2xl:text-sm md:tracking-wider">
                    <div className="">
                      <a
                        href={`mailto:${footer?.branding?.email}`}
                        className="hover:text-blue-300 transition-colors"
                      >
                        {footer?.branding?.email}
                      </a>
                    </div>
                  </div>
                </div>
                {/* social media 2*/}
                {/* --------------------------------------------------------------------------------------------------------- */}
                <div className="space-x-2 md:flex lg:hidden">
                  <div className="block w-[50px] xl:w-[55px] 2xl:w-[70px]">
                    <svg
                      width="20"
                      height="20"
                      viewBox="0 0 40 40"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                      <path
                        d="M27.0499 18.0249C26.9329 16.8074 26.5026 15.6408 25.8009 14.6389C25.0992 13.6371 24.15 12.834 23.0457 12.3078C21.9415 11.7817 20.7198 11.5505 19.4997 11.6368C18.2795 11.723 17.1025 12.1237 16.0832 12.7999C15.2076 13.3855 14.4724 14.1577 13.9307 15.0611C13.3889 15.9645 13.054 16.9767 12.9499 18.0249C12.8478 19.0663 12.9788 20.1174 13.3334 21.1018C13.688 22.0863 14.2572 22.9795 14.9999 23.7166L19.4166 28.1416C19.494 28.2197 19.5862 28.2817 19.6878 28.324C19.7893 28.3663 19.8982 28.3881 20.0082 28.3881C20.1182 28.3881 20.2272 28.3663 20.3287 28.324C20.4303 28.2817 20.5224 28.2197 20.5999 28.1416L24.9999 23.7166C25.7426 22.9795 26.3118 22.0863 26.6664 21.1018C27.021 20.1174 27.152 19.0663 27.0499 18.0249ZM23.8332 22.5416L19.9999 26.3749L16.1666 22.5416C15.6016 21.9766 15.1689 21.2935 14.8995 20.5414C14.63 19.7893 14.5306 18.9868 14.6082 18.1916C14.6864 17.3842 14.943 16.6042 15.3595 15.9081C15.776 15.212 16.342 14.6172 17.0166 14.1666C17.9007 13.5793 18.9385 13.266 19.9999 13.266C21.0613 13.266 22.0991 13.5793 22.9832 14.1666C23.6557 14.6154 24.2205 15.2077 24.6369 15.9007C25.0533 16.5938 25.311 17.3704 25.3916 18.1749C25.4718 18.9728 25.3736 19.7785 25.1041 20.5337C24.8345 21.2889 24.4005 21.9748 23.8332 22.5416ZM19.9999 14.9999C19.2582 14.9999 18.5332 15.2199 17.9165 15.6319C17.2998 16.044 16.8192 16.6296 16.5354 17.3149C16.2515 18.0001 16.1773 18.7541 16.322 19.4815C16.4667 20.209 16.8238 20.8771 17.3483 21.4016C17.8727 21.926 18.5409 22.2832 19.2683 22.4279C19.9957 22.5726 20.7497 22.4983 21.435 22.2145C22.1202 21.9307 22.7059 21.45 23.1179 20.8333C23.53 20.2166 23.7499 19.4916 23.7499 18.7499C23.7477 17.756 23.3519 16.8035 22.6491 16.1007C21.9463 15.3979 20.9938 15.0021 19.9999 14.9999ZM19.9999 20.8333C19.5879 20.8333 19.1851 20.7111 18.8425 20.4822C18.4999 20.2532 18.2328 19.9279 18.0752 19.5472C17.9175 19.1665 17.8762 18.7476 17.9566 18.3435C18.037 17.9394 18.2354 17.5682 18.5268 17.2768C18.8181 16.9854 19.1893 16.787 19.5935 16.7066C19.9976 16.6262 20.4165 16.6675 20.7972 16.8252C21.1778 16.9829 21.5032 17.2499 21.7321 17.5925C21.961 17.9351 22.0832 18.3379 22.0832 18.7499C22.0832 19.3025 21.8637 19.8324 21.473 20.2231C21.0823 20.6138 20.5524 20.8333 19.9999 20.8333Z"
                        fill="white"
                      />
                    </svg>
                  </div>

                  <Link
                    target="_blank"
                    // href="https://www.google.com/maps?ll=23.770282,90.40626&z=16&t=m&hl=en-GB&gl=US&mapclient=embed&cid=8200627424099091507"
                    href={footer?.branding?.mapUrl || ''}
                    className="text-[11px] md:text-xs 2xl:text-sm md:tracking-wider hover:text-blue-300 cursor-pointer transition-all duration-100"
                  >
                    <div className="">
                      <LocalizedText
                        en={footer?.branding?.address}
                        bn={footer?.branding?.addressBN}
                      />
                    </div>
                  </Link>
                </div>
                <div className="hidden space-x-2 lg:flex xl:hidden">
                  <div className="hidden md:block w-[50px] xl:w-[55px] 2xl:w-[70px]">
                    <svg
                      width="28"
                      height="28"
                      viewBox="0 0 40 40"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                      <path
                        d="M27.0499 18.0249C26.9329 16.8074 26.5026 15.6408 25.8009 14.6389C25.0992 13.6371 24.15 12.834 23.0457 12.3078C21.9415 11.7817 20.7198 11.5505 19.4997 11.6368C18.2795 11.723 17.1025 12.1237 16.0832 12.7999C15.2076 13.3855 14.4724 14.1577 13.9307 15.0611C13.3889 15.9645 13.054 16.9767 12.9499 18.0249C12.8478 19.0663 12.9788 20.1174 13.3334 21.1018C13.688 22.0863 14.2572 22.9795 14.9999 23.7166L19.4166 28.1416C19.494 28.2197 19.5862 28.2817 19.6878 28.324C19.7893 28.3663 19.8982 28.3881 20.0082 28.3881C20.1182 28.3881 20.2272 28.3663 20.3287 28.324C20.4303 28.2817 20.5224 28.2197 20.5999 28.1416L24.9999 23.7166C25.7426 22.9795 26.3118 22.0863 26.6664 21.1018C27.021 20.1174 27.152 19.0663 27.0499 18.0249ZM23.8332 22.5416L19.9999 26.3749L16.1666 22.5416C15.6016 21.9766 15.1689 21.2935 14.8995 20.5414C14.63 19.7893 14.5306 18.9868 14.6082 18.1916C14.6864 17.3842 14.943 16.6042 15.3595 15.9081C15.776 15.212 16.342 14.6172 17.0166 14.1666C17.9007 13.5793 18.9385 13.266 19.9999 13.266C21.0613 13.266 22.0991 13.5793 22.9832 14.1666C23.6557 14.6154 24.2205 15.2077 24.6369 15.9007C25.0533 16.5938 25.311 17.3704 25.3916 18.1749C25.4718 18.9728 25.3736 19.7785 25.1041 20.5337C24.8345 21.2889 24.4005 21.9748 23.8332 22.5416ZM19.9999 14.9999C19.2582 14.9999 18.5332 15.2199 17.9165 15.6319C17.2998 16.044 16.8192 16.6296 16.5354 17.3149C16.2515 18.0001 16.1773 18.7541 16.322 19.4815C16.4667 20.209 16.8238 20.8771 17.3483 21.4016C17.8727 21.926 18.5409 22.2832 19.2683 22.4279C19.9957 22.5726 20.7497 22.4983 21.435 22.2145C22.1202 21.9307 22.7059 21.45 23.1179 20.8333C23.53 20.2166 23.7499 19.4916 23.7499 18.7499C23.7477 17.756 23.3519 16.8035 22.6491 16.1007C21.9463 15.3979 20.9938 15.0021 19.9999 14.9999ZM19.9999 20.8333C19.5879 20.8333 19.1851 20.7111 18.8425 20.4822C18.4999 20.2532 18.2328 19.9279 18.0752 19.5472C17.9175 19.1665 17.8762 18.7476 17.9566 18.3435C18.037 17.9394 18.2354 17.5682 18.5268 17.2768C18.8181 16.9854 19.1893 16.787 19.5935 16.7066C19.9976 16.6262 20.4165 16.6675 20.7972 16.8252C21.1778 16.9829 21.5032 17.2499 21.7321 17.5925C21.961 17.9351 22.0832 18.3379 22.0832 18.7499C22.0832 19.3025 21.8637 19.8324 21.473 20.2231C21.0823 20.6138 20.5524 20.8333 19.9999 20.8333Z"
                        fill="white"
                      />
                    </svg>
                  </div>

                  <Link
                    target="_blank"
                    // href="https://www.google.com/maps?ll=23.770282,90.40626&z=16&t=m&hl=en-GB&gl=US&mapclient=embed&cid=8200627424099091507"
                    href={footer?.branding?.mapUrl || ''}
                    className="text-[11px] md:text-xs 2xl:text-sm md:tracking-wider hover:text-blue-300 cursor-pointer transition-all duration-100"
                  >
                    <div className="">
                      <LocalizedText
                        en={footer?.branding?.address}
                        bn={footer?.branding?.addressBN}
                      />
                    </div>
                  </Link>
                </div>
                <div className="hidden space-x-2 xl:flex 2xl:hidden">
                  <div className="hidden md:block w-[50px] xl:w-[55px] 2xl:w-[70px]">
                    <svg
                      width="30"
                      height="30"
                      viewBox="0 0 40 40"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                      <path
                        d="M27.0499 18.0249C26.9329 16.8074 26.5026 15.6408 25.8009 14.6389C25.0992 13.6371 24.15 12.834 23.0457 12.3078C21.9415 11.7817 20.7198 11.5505 19.4997 11.6368C18.2795 11.723 17.1025 12.1237 16.0832 12.7999C15.2076 13.3855 14.4724 14.1577 13.9307 15.0611C13.3889 15.9645 13.054 16.9767 12.9499 18.0249C12.8478 19.0663 12.9788 20.1174 13.3334 21.1018C13.688 22.0863 14.2572 22.9795 14.9999 23.7166L19.4166 28.1416C19.494 28.2197 19.5862 28.2817 19.6878 28.324C19.7893 28.3663 19.8982 28.3881 20.0082 28.3881C20.1182 28.3881 20.2272 28.3663 20.3287 28.324C20.4303 28.2817 20.5224 28.2197 20.5999 28.1416L24.9999 23.7166C25.7426 22.9795 26.3118 22.0863 26.6664 21.1018C27.021 20.1174 27.152 19.0663 27.0499 18.0249ZM23.8332 22.5416L19.9999 26.3749L16.1666 22.5416C15.6016 21.9766 15.1689 21.2935 14.8995 20.5414C14.63 19.7893 14.5306 18.9868 14.6082 18.1916C14.6864 17.3842 14.943 16.6042 15.3595 15.9081C15.776 15.212 16.342 14.6172 17.0166 14.1666C17.9007 13.5793 18.9385 13.266 19.9999 13.266C21.0613 13.266 22.0991 13.5793 22.9832 14.1666C23.6557 14.6154 24.2205 15.2077 24.6369 15.9007C25.0533 16.5938 25.311 17.3704 25.3916 18.1749C25.4718 18.9728 25.3736 19.7785 25.1041 20.5337C24.8345 21.2889 24.4005 21.9748 23.8332 22.5416ZM19.9999 14.9999C19.2582 14.9999 18.5332 15.2199 17.9165 15.6319C17.2998 16.044 16.8192 16.6296 16.5354 17.3149C16.2515 18.0001 16.1773 18.7541 16.322 19.4815C16.4667 20.209 16.8238 20.8771 17.3483 21.4016C17.8727 21.926 18.5409 22.2832 19.2683 22.4279C19.9957 22.5726 20.7497 22.4983 21.435 22.2145C22.1202 21.9307 22.7059 21.45 23.1179 20.8333C23.53 20.2166 23.7499 19.4916 23.7499 18.7499C23.7477 17.756 23.3519 16.8035 22.6491 16.1007C21.9463 15.3979 20.9938 15.0021 19.9999 14.9999ZM19.9999 20.8333C19.5879 20.8333 19.1851 20.7111 18.8425 20.4822C18.4999 20.2532 18.2328 19.9279 18.0752 19.5472C17.9175 19.1665 17.8762 18.7476 17.9566 18.3435C18.037 17.9394 18.2354 17.5682 18.5268 17.2768C18.8181 16.9854 19.1893 16.787 19.5935 16.7066C19.9976 16.6262 20.4165 16.6675 20.7972 16.8252C21.1778 16.9829 21.5032 17.2499 21.7321 17.5925C21.961 17.9351 22.0832 18.3379 22.0832 18.7499C22.0832 19.3025 21.8637 19.8324 21.473 20.2231C21.0823 20.6138 20.5524 20.8333 19.9999 20.8333Z"
                        fill="white"
                      />
                    </svg>
                  </div>

                  <Link
                    target="_blank"
                    // href="https://www.google.com/maps?ll=23.770282,90.40626&z=16&t=m&hl=en-GB&gl=US&mapclient=embed&cid=8200627424099091507"
                    href={footer?.branding?.mapUrl || ''}
                    className="text-[11px] md:text-xs 2xl:text-sm md:tracking-wider hover:text-blue-300 cursor-pointer transition-all duration-100"
                  >
                    <div className="">
                      <LocalizedText
                        en={footer?.branding?.address}
                        bn={footer?.branding?.addressBN}
                      />
                    </div>
                  </Link>
                </div>
                <div className="hidden space-x-2 2xl:flex">
                  <div className="hidden md:block w-[50px] xl:w-[55px] 2xl:w-[70px]">
                    <svg
                      width="40"
                      height="40"
                      viewBox="0 0 40 40"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                      <path
                        d="M27.0499 18.0249C26.9329 16.8074 26.5026 15.6408 25.8009 14.6389C25.0992 13.6371 24.15 12.834 23.0457 12.3078C21.9415 11.7817 20.7198 11.5505 19.4997 11.6368C18.2795 11.723 17.1025 12.1237 16.0832 12.7999C15.2076 13.3855 14.4724 14.1577 13.9307 15.0611C13.3889 15.9645 13.054 16.9767 12.9499 18.0249C12.8478 19.0663 12.9788 20.1174 13.3334 21.1018C13.688 22.0863 14.2572 22.9795 14.9999 23.7166L19.4166 28.1416C19.494 28.2197 19.5862 28.2817 19.6878 28.324C19.7893 28.3663 19.8982 28.3881 20.0082 28.3881C20.1182 28.3881 20.2272 28.3663 20.3287 28.324C20.4303 28.2817 20.5224 28.2197 20.5999 28.1416L24.9999 23.7166C25.7426 22.9795 26.3118 22.0863 26.6664 21.1018C27.021 20.1174 27.152 19.0663 27.0499 18.0249ZM23.8332 22.5416L19.9999 26.3749L16.1666 22.5416C15.6016 21.9766 15.1689 21.2935 14.8995 20.5414C14.63 19.7893 14.5306 18.9868 14.6082 18.1916C14.6864 17.3842 14.943 16.6042 15.3595 15.9081C15.776 15.212 16.342 14.6172 17.0166 14.1666C17.9007 13.5793 18.9385 13.266 19.9999 13.266C21.0613 13.266 22.0991 13.5793 22.9832 14.1666C23.6557 14.6154 24.2205 15.2077 24.6369 15.9007C25.0533 16.5938 25.311 17.3704 25.3916 18.1749C25.4718 18.9728 25.3736 19.7785 25.1041 20.5337C24.8345 21.2889 24.4005 21.9748 23.8332 22.5416ZM19.9999 14.9999C19.2582 14.9999 18.5332 15.2199 17.9165 15.6319C17.2998 16.044 16.8192 16.6296 16.5354 17.3149C16.2515 18.0001 16.1773 18.7541 16.322 19.4815C16.4667 20.209 16.8238 20.8771 17.3483 21.4016C17.8727 21.926 18.5409 22.2832 19.2683 22.4279C19.9957 22.5726 20.7497 22.4983 21.435 22.2145C22.1202 21.9307 22.7059 21.45 23.1179 20.8333C23.53 20.2166 23.7499 19.4916 23.7499 18.7499C23.7477 17.756 23.3519 16.8035 22.6491 16.1007C21.9463 15.3979 20.9938 15.0021 19.9999 14.9999ZM19.9999 20.8333C19.5879 20.8333 19.1851 20.7111 18.8425 20.4822C18.4999 20.2532 18.2328 19.9279 18.0752 19.5472C17.9175 19.1665 17.8762 18.7476 17.9566 18.3435C18.037 17.9394 18.2354 17.5682 18.5268 17.2768C18.8181 16.9854 19.1893 16.787 19.5935 16.7066C19.9976 16.6262 20.4165 16.6675 20.7972 16.8252C21.1778 16.9829 21.5032 17.2499 21.7321 17.5925C21.961 17.9351 22.0832 18.3379 22.0832 18.7499C22.0832 19.3025 21.8637 19.8324 21.473 20.2231C21.0823 20.6138 20.5524 20.8333 19.9999 20.8333Z"
                        fill="white"
                      />
                    </svg>
                  </div>

                  <Link
                    target="_blank"
                    // href="https://www.google.com/maps?ll=23.770282,90.40626&z=16&t=m&hl=en-GB&gl=US&mapclient=embed&cid=8200627424099091507"
                    href={footer?.branding?.mapUrl || ''}
                    className="text-[11px] md:text-xs 2xl:text-sm md:tracking-wider hover:text-blue-300 cursor-pointer transition-all duration-100"
                  >
                    <div className="">
                      <LocalizedText
                        en={footer?.branding?.address}
                        bn={footer?.branding?.addressBN}
                      />
                    </div>
                  </Link>
                </div>

                {/* --------------------------------------------------------------------------------------------------------- */}

                {/* social media 3*/}
                <div className="flex space-x-2 ">
                  <div className="hidden md:block w-[20px] lg:w-[30px] 2xl:w-[40px] h-[20px] lg:h-[30px] 2xl:h-[40px]">
                    <svg
                      // width="40"
                      // height="40"
                      viewBox="0 0 40 40"
                      fill="none"
                      xmlns="http://www.w3.org/2000/svg"
                    >
                      <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                      <path
                        d="M26.2001 20.8328C26.0168 20.8328 25.8251 20.7745 25.6418 20.7328C25.2705 20.651 24.9056 20.5424 24.5501 20.4078C24.1635 20.2672 23.7385 20.2745 23.357 20.4283C22.9755 20.5822 22.6643 20.8717 22.4834 21.2411L22.3001 21.6161C21.4884 21.1646 20.7426 20.6038 20.0834 19.9495C19.4291 19.2903 18.8683 18.5445 18.4168 17.7328L18.7668 17.4995C19.1362 17.3186 19.4257 17.0074 19.5796 16.6259C19.7334 16.2444 19.7407 15.8194 19.6001 15.4328C19.4678 15.0765 19.3592 14.7118 19.2751 14.3411C19.2334 14.1578 19.2001 13.9661 19.1751 13.7745C19.0739 13.1875 18.7664 12.6559 18.3081 12.2755C17.8498 11.8951 17.2707 11.6908 16.6751 11.6995H14.1751C13.8159 11.6961 13.4603 11.7702 13.1323 11.9166C12.8044 12.063 12.5118 12.2784 12.2746 12.5481C12.0374 12.8177 11.861 13.1353 11.7576 13.4792C11.6541 13.8232 11.626 14.1854 11.6751 14.5411C12.119 18.0323 13.7134 21.276 16.2065 23.76C18.6995 26.244 21.949 27.8266 25.4418 28.2578H25.7584C26.3729 28.2587 26.9662 28.0333 27.4251 27.6245C27.6887 27.3887 27.8993 27.0996 28.043 26.7764C28.1866 26.4532 28.2601 26.1032 28.2584 25.7495V23.2495C28.2482 22.6706 28.0374 22.1133 27.662 21.6725C27.2866 21.2318 26.7699 20.935 26.2001 20.8328ZM26.6168 25.8328C26.6166 25.9511 26.5913 26.0681 26.5424 26.1758C26.4936 26.2836 26.4223 26.3797 26.3334 26.4578C26.2403 26.5382 26.1314 26.5983 26.0138 26.6341C25.8961 26.67 25.7722 26.6809 25.6501 26.6661C22.5292 26.266 19.6303 24.8382 17.4107 22.6081C15.1911 20.3779 13.7771 17.4723 13.3918 14.3495C13.3785 14.2274 13.3901 14.1039 13.4259 13.9865C13.4617 13.869 13.521 13.7601 13.6001 13.6661C13.6782 13.5773 13.7743 13.506 13.8821 13.4572C13.9898 13.4083 14.1068 13.383 14.2251 13.3828H16.7251C16.9189 13.3785 17.1081 13.4419 17.2602 13.562C17.4123 13.6822 17.5178 13.8516 17.5584 14.0411C17.5918 14.2689 17.6334 14.4939 17.6834 14.7161C17.7797 15.1554 17.9078 15.5871 18.0668 16.0078L16.9001 16.5495C16.8003 16.5953 16.7106 16.6603 16.636 16.7408C16.5615 16.8214 16.5036 16.9158 16.4656 17.0188C16.4277 17.1218 16.4105 17.2313 16.415 17.3409C16.4194 17.4506 16.4455 17.5583 16.4918 17.6578C17.6911 20.2268 19.7561 22.2918 22.3251 23.4911C22.528 23.5745 22.7555 23.5745 22.9584 23.4911C23.0623 23.454 23.1579 23.3965 23.2394 23.3221C23.3209 23.2477 23.3869 23.1579 23.4334 23.0578L23.9501 21.8911C24.3809 22.0452 24.8206 22.1732 25.2668 22.2745C25.489 22.3245 25.714 22.3661 25.9418 22.3995C26.1313 22.4401 26.3007 22.5456 26.4209 22.6977C26.541 22.8498 26.6044 23.039 26.6001 23.2328L26.6168 25.8328Z"
                        fill="white"
                      />
                    </svg>
                  </div>
                  <div className="text-[11px] md:text-xs 2xl:text-sm md:tracking-wider">
                    <div className="">
                      <a
                        href={`tel:${footer?.branding?.phone}`}
                        className="hover:text-blue-300 transition-colors"
                      >
                        <LocalizedText
                          en={footer?.branding?.phone}
                          bn={footer?.branding?.phoneBN}
                        />
                      </a>
                    </div>
                    <div className="">
                      <LocalizedText
                        en={footer?.branding?.phoneNote}
                        bn={footer?.branding?.phoneNoteBN}
                      />
                    </div>
                  </div>
                </div>
              </div>
            </div>
            {/* grid 2 */}
            <div className="flex flex-col space-y-3 p-2 lg:py-5 items-center -mt-16 md:-mt-12 lg:mt-0 lg:col-span-2">
              <div>
                <h1 className="text-sm lg:text-[16px] xl:text-xl 2xl:text-2xl font-medium mb-2 lg:mb-6 md:px-12 lg:px-0 text-white/50">
                  <LocalizedText
                    en={footer?.exploreSection?.exploreHeader}
                    bn={footer?.exploreSection?.exploreHeaderBN}
                  />
                </h1>
                <div>
                  {/* <ul className="flex flex-col space-y-1 md:space-y-2 text-xs 2xl:text-lg"> */}
                  <ul
                    className="flex flex-col md:flex-row lg:flex-col space-y-1 md:space-y-0 lg:space-y-2 text-xs 2xl:text-lg md:flex-wrap lg:flex-nowrap
              md:gap-2 md:px-12 lg:px-0 lg:gap-0"
                  >
                    {footer?.exploreSection?.explore?.map((link, index) => (
                      <li
                        key={index}
                        className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100"
                      >
                        <Link href={pageHref(link?.buttonLink)}>
                          <LocalizedText en={link?.buttonText} bn={link?.buttonTextBN} />
                        </Link>
                      </li>
                    ))}
                    {/* <li className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100">
                      <Link href={'/plans'}>
                        <LocalizedText en="Solutions" bn="সলিউশন" />
                      </Link>
                    </li>
                    <li className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100">
                      <Link href={'/career'}>
                        <LocalizedText en="Career" bn="ক্যারিয়ার" />
                      </Link>
                    </li>
                    <li className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100">
                      <Link href={'/news-and-media'}>
                        <LocalizedText en="Media & Blogs" bn="মিডিয়া এন্ড ব্লগস" />
                      </Link>
                    </li>

                    <li className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100">
                      <Link href={'/support'}>
                        <LocalizedText en="Support" bn="সাপোর্ট" />
                      </Link>
                    </li>
                    <li className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100">
                      <Link href={'/premium-calculator'}>
                        <LocalizedText en="Premium Calculator" bn="প্রিমিয়াম ক্যালকুলেটর" />
                      </Link>
                    </li>
                    <ToolTip>
                      <span className=" cursor-not-allowed">
                        <LocalizedText en="Learning" bn="লার্নিং" />
                      </span>
                    </ToolTip> */}
                  </ul>
                </div>
              </div>
            </div>
            {/* grid 3 */}
            <div className="flex flex-col space-y-3 p-2 lg:py-5 items-center -mt-16 md:-mt-12 lg:mt-0 lg:col-span-1">
              <div>
                <h1 className=" text-sm lg:text-[16px] xl:text-xl 2xl:text-2xl font-medium mb-6 text-white/50">
                  <LocalizedText
                    en={footer?.legalSection?.legalHeader}
                    bn={footer?.legalSection?.legalHeaderBN}
                  />
                </h1>
                <div>
                  <ul className="flex flex-col space-y-2 text-xs 2xl:text-lg">
                    {footer?.legalSection?.legal?.map((link, index) => (
                      <li
                        key={index}
                        className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100"
                      >
                        <Link href={pageHref(link?.buttonLink)}>
                          <LocalizedText en={link?.buttonText} bn={link?.buttonTextBN} />
                        </Link>
                      </li>
                    ))}
                    {/* <li className="hover:text-[#FF6600] cursor-pointer hover:underline transition-all duration-100">
                      <Link href={'/terms-condition'}>
                        <LocalizedText en="Terms & Conditions" bn="টার্মস এন্ড কন্ডিশন" />
                      </Link>
                    </li> */}
                  </ul>
                </div>
              </div>
            </div>
            {/* grid 4 */}
            <div
              className="flex flex-col space-y-3 p-2 lg:py-5 items-center -mt-16 md:-mt-12 lg:mt-0 lg:col-span-3 
         lg:ml-6 xl:ml-10 2xl:ml-24"
            >
              <div>
                <h1 className=" text-sm lg:text-[16px] xl:text-xl 2xl:text-2xl font-medium text-white/50">
                  <LocalizedText
                    en={footer?.social?.socialHeader}
                    bn={footer?.social?.socialHeaderBN}
                  />
                </h1>
                <div className="flex space-x-2 mt-3 2xl:mt-4">
                  <div className="w-[20px] h-[20px] lg:w-[30px] lg:h-[30px] 2xl:w-[40px] 2xl:h-[40px]">
                    <Link
                      target="_blank"
                      // href="https://www.facebook.com/profile.php?id=61566152682701"
                      href={footer?.social?.facebookUrl}
                    >
                      <svg
                        // width="30"
                        // height="30"
                        viewBox="0 0 40 40"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                        <path
                          d="M22.34 14.99H23.75V12.605C23.0673 12.534 22.3814 12.499 21.695 12.5C19.655 12.5 18.26 13.745 18.26 16.025V17.99H15.9575V20.66H18.26V27.5H21.02V20.66H23.315L23.66 17.99H21.02V16.2875C21.02 15.5 21.23 14.99 22.34 14.99Z"
                          fill="white"
                        />
                      </svg>
                    </Link>
                  </div>
                  <div className="w-[20px] h-[20px] lg:w-[30px] lg:h-[30px] 2xl:w-[40px] 2xl:h-[40px]">
                    <Link target="_blank" href={footer?.social?.youtubeUrl}>
                      <svg
                        // width="30"
                        // height="30"
                        viewBox="0 0 40 40"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                        <path
                          d="M23.4 19.1596L18.5 15.9996C18.348 15.9118 18.1755 15.8656 18 15.8656C17.8245 15.8656 17.652 15.9118 17.5 15.9996C17.3517 16.0851 17.2279 16.2072 17.1404 16.3543C17.0528 16.5014 17.0045 16.6685 17 16.8396V23.1596C17.0013 23.3378 17.0502 23.5124 17.1416 23.6653C17.233 23.8183 17.3637 23.944 17.52 24.0296C17.6654 24.1152 17.8312 24.1601 18 24.1596C18.1771 24.1474 18.3487 24.0925 18.5 23.9996L23.4 20.8396C23.5403 20.7489 23.6557 20.6245 23.7356 20.4778C23.8155 20.3311 23.8574 20.1666 23.8574 19.9996C23.8574 19.8325 23.8155 19.6681 23.7356 19.5213C23.6557 19.3746 23.5403 19.2502 23.4 19.1596ZM19 21.3196V18.6796L21 19.9996L19 21.3196ZM27.38 12.5096L25.83 12.3096C21.991 11.8395 18.109 11.8395 14.27 12.3096L12.72 12.5096C11.9747 12.5907 11.2854 12.9434 10.7837 13.5005C10.282 14.0575 10.003 14.7799 10 15.5296V24.4696C10.0064 25.2081 10.2805 25.9193 10.7715 26.471C11.2626 27.0228 11.9372 27.3776 12.67 27.4696L14.22 27.6596C16.1378 27.8926 18.0681 28.0061 20 27.9996C21.9323 27.9995 23.8627 27.8793 25.78 27.6396L27.33 27.4496C28.0628 27.3576 28.7374 27.0028 29.2285 26.451C29.7195 25.8993 29.9936 25.1881 30 24.4496V15.5296C29.9985 14.7875 29.7265 14.0715 29.235 13.5156C28.7435 12.9597 28.0662 12.602 27.33 12.5096H27.38ZM28.05 24.5096C28.0508 24.7615 27.9565 25.0044 27.7859 25.1898C27.6154 25.3752 27.3811 25.4894 27.13 25.5096L25.58 25.6996C21.9077 26.1596 18.1923 26.1596 14.52 25.6996L12.97 25.5096C12.7189 25.4894 12.4846 25.3752 12.3141 25.1898C12.1435 25.0044 12.0492 24.7615 12.05 24.5096V15.5296C12.0619 15.2815 12.1606 15.0455 12.3287 14.8628C12.4968 14.68 12.7238 14.5621 12.97 14.5296L14.47 14.2996C18.1427 13.8462 21.8573 13.8462 25.53 14.2996L27.08 14.4896C27.3262 14.5221 27.5532 14.64 27.7213 14.8228C27.8894 15.0055 27.9881 15.2415 28 15.4896L28.05 24.5096Z"
                          fill="white"
                        />
                      </svg>
                    </Link>
                  </div>
                  <div className="w-[20px] h-[20px] lg:w-[30px] lg:h-[30px] 2xl:w-[40px] 2xl:h-[40px]">
                    <Link target="_blank" href={footer?.social?.linkedinUrl}>
                      <svg
                        // width="40"
                        // height="40"
                        viewBox="0 0 40 40"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                        <path
                          d="M27.0585 11.6661H12.9418C12.7831 11.6639 12.6255 11.693 12.4781 11.7517C12.3307 11.8104 12.1962 11.8976 12.0825 12.0082C11.9687 12.1189 11.8779 12.2509 11.8151 12.3966C11.7524 12.5424 11.719 12.6991 11.7168 12.8578V27.1411C11.719 27.2998 11.7524 27.4565 11.8151 27.6023C11.8779 27.7481 11.9687 27.88 12.0825 27.9907C12.1962 28.1014 12.3307 28.1885 12.4781 28.2472C12.6255 28.3059 12.7831 28.335 12.9418 28.3328H27.0585C27.2171 28.335 27.3747 28.3059 27.5222 28.2472C27.6696 28.1885 27.804 28.1014 27.9178 27.9907C28.0316 27.88 28.1224 27.7481 28.1851 27.6023C28.2479 27.4565 28.2813 27.2998 28.2835 27.1411V12.8578C28.2813 12.6991 28.2479 12.5424 28.1851 12.3966C28.1224 12.2509 28.0316 12.1189 27.9178 12.0082C27.804 11.8976 27.6696 11.8104 27.5222 11.7517C27.3747 11.693 27.2171 11.6639 27.0585 11.6661ZM16.7418 25.6161H14.2418V18.1161H16.7418V25.6161ZM15.4918 17.0661C15.147 17.0661 14.8164 16.9292 14.5726 16.6854C14.3288 16.4416 14.1918 16.1109 14.1918 15.7661C14.1918 15.4214 14.3288 15.0907 14.5726 14.8469C14.8164 14.6031 15.147 14.4661 15.4918 14.4661C15.6749 14.4454 15.8603 14.4635 16.0359 14.5194C16.2114 14.5752 16.3732 14.6675 16.5107 14.7903C16.6481 14.913 16.7581 15.0634 16.8334 15.2315C16.9086 15.3997 16.9476 15.5819 16.9476 15.7661C16.9476 15.9504 16.9086 16.1326 16.8334 16.3007C16.7581 16.4689 16.6481 16.6193 16.5107 16.742C16.3732 16.8647 16.2114 16.957 16.0359 17.0129C15.8603 17.0688 15.6749 17.0869 15.4918 17.0661ZM25.7585 25.6161H23.2585V21.5911C23.2585 20.5828 22.9001 19.9245 21.9918 19.9245C21.7107 19.9265 21.437 20.0147 21.2075 20.1771C20.978 20.3395 20.8039 20.5684 20.7085 20.8328C20.6433 21.0287 20.615 21.2349 20.6251 21.4411V25.6078H18.1251C18.1251 25.6078 18.1251 18.7911 18.1251 18.1078H20.6251V19.1661C20.8522 18.7721 21.1826 18.4474 21.5805 18.2271C21.9784 18.0069 22.4289 17.8993 22.8835 17.9161C24.5501 17.9161 25.7585 18.9911 25.7585 21.2995V25.6161Z"
                          fill="white"
                        />
                      </svg>
                    </Link>
                  </div>
                  <div className="w-[20px] h-[20px] lg:w-[30px] lg:h-[30px] 2xl:w-[40px] 2xl:h-[40px]">
                    <Link target="_blank" href={footer?.social?.instagramUrl}>
                      <svg
                        // width="40"
                        // height="40"
                        viewBox="0 0 40 40"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <circle cx="20" cy="20" r="20" fill="#D9D9D9" fillOpacity="0.2" />
                        <path
                          d="M19.9998 15.8327C19.1757 15.8327 18.3702 16.0771 17.685 16.5349C16.9998 16.9927 16.4657 17.6435 16.1503 18.4048C15.835 19.1662 15.7525 20.004 15.9132 20.8122C16.074 21.6205 16.4708 22.3629 17.0536 22.9456C17.6363 23.5283 18.3787 23.9252 19.187 24.086C19.9952 24.2467 20.833 24.1642 21.5943 23.8488C22.3557 23.5335 23.0065 22.9994 23.4643 22.3142C23.9221 21.629 24.1665 20.8234 24.1665 19.9993C24.1665 18.8943 23.7275 17.8345 22.9461 17.0531C22.1647 16.2717 21.1049 15.8327 19.9998 15.8327ZM19.9998 22.4993C19.5054 22.4993 19.022 22.3527 18.6109 22.078C18.1998 21.8033 17.8794 21.4129 17.6901 20.9561C17.5009 20.4992 17.4514 19.9966 17.5479 19.5116C17.6443 19.0267 17.8824 18.5812 18.2321 18.2316C18.5817 17.8819 19.0272 17.6438 19.5121 17.5474C19.9971 17.4509 20.4997 17.5004 20.9565 17.6896C21.4134 17.8789 21.8038 18.1993 22.0785 18.6104C22.3532 19.0215 22.4998 19.5049 22.4998 19.9993C22.4998 20.6624 22.2364 21.2983 21.7676 21.7671C21.2988 22.236 20.6629 22.4993 19.9998 22.4993ZM24.1665 14.9993C24.0017 14.9993 23.8406 15.0482 23.7035 15.1398C23.5665 15.2314 23.4597 15.3615 23.3966 15.5138C23.3335 15.6661 23.317 15.8336 23.3492 15.9953C23.3813 16.1569 23.4607 16.3054 23.5772 16.4219C23.6938 16.5385 23.8423 16.6178 24.0039 16.65C24.1656 16.6822 24.3331 16.6657 24.4854 16.6026C24.6377 16.5395 24.7678 16.4327 24.8594 16.2957C24.951 16.1586 24.9998 15.9975 24.9998 15.8327C24.9998 15.6117 24.912 15.3997 24.7558 15.2434C24.5995 15.0871 24.3875 14.9993 24.1665 14.9993ZM28.2832 16.866C28.2694 16.1539 28.1341 15.4493 27.8832 14.7827C27.6505 14.1761 27.2928 13.6252 26.8334 13.1658C26.374 12.7064 25.8231 12.3487 25.2165 12.116C24.5499 11.8651 23.8453 11.7298 23.1332 11.716C22.3248 11.666 22.0582 11.666 19.9998 11.666C17.9415 11.666 17.6748 11.666 16.8665 11.716C16.1544 11.7298 15.4498 11.8651 14.7832 12.116C14.1766 12.3487 13.6257 12.7064 13.1663 13.1658C12.7068 13.6252 12.3492 14.1761 12.1165 14.7827C11.8656 15.4493 11.7303 16.1539 11.7165 16.866C11.6665 17.6827 11.6665 17.9493 11.6665 19.9993C11.6665 22.0493 11.6665 22.316 11.7165 23.1327C11.7303 23.8448 11.8656 24.5494 12.1165 25.216C12.3492 25.8226 12.7068 26.3735 13.1663 26.8329C13.6257 27.2923 14.1766 27.65 14.7832 27.8827C15.4498 28.1336 16.1544 28.2689 16.8665 28.2827C17.6998 28.2827 17.9415 28.3327 19.9998 28.3327C22.0582 28.3327 22.3248 28.3327 23.1332 28.2827C23.8453 28.2689 24.5499 28.1336 25.2165 27.8827C25.8231 27.65 26.374 27.2923 26.8334 26.8329C27.2928 26.3735 27.6505 25.8226 27.8832 25.216C28.1341 24.5494 28.2694 23.8448 28.2832 23.1327C28.2832 22.2993 28.3332 22.0493 28.3332 19.9993C28.3332 17.9493 28.3332 17.6827 28.2832 16.866ZM26.6165 23.0577C26.6019 23.5865 26.5034 24.1097 26.3248 24.6077C26.1772 25.0013 25.9437 25.3571 25.6415 25.6493C25.351 25.9517 24.9945 26.1827 24.5998 26.3243C24.1007 26.5103 23.574 26.6117 23.0415 26.6243C22.2582 26.6243 22.0165 26.666 19.9915 26.666C17.9665 26.666 17.7332 26.666 16.9498 26.666C16.4182 26.6523 15.8921 26.5538 15.3915 26.3743C14.9979 26.2267 14.6421 25.9933 14.3498 25.691C14.0475 25.4005 13.8164 25.044 13.6748 24.6493C13.4897 24.1529 13.3883 23.6291 13.3748 23.0993C13.3748 22.266 13.3748 22.0577 13.3748 20.041C13.3748 18.0243 13.3748 17.7827 13.3748 16.9827C13.3892 16.4504 13.4905 15.924 13.6748 15.4243C13.8186 15.0332 14.0494 14.6799 14.3498 14.391C14.6403 14.0886 14.9968 13.8576 15.3915 13.716C15.8907 13.5301 16.4173 13.4287 16.9498 13.416C17.7332 13.3327 17.9748 13.3327 19.9998 13.3327C22.0248 13.3327 22.2665 13.3327 23.0498 13.3327C23.585 13.3463 24.1142 13.4476 24.6165 13.6327C25.0076 13.7765 25.361 14.0073 25.6498 14.3077C25.9522 14.5982 26.1832 14.9547 26.3248 15.3493C26.5288 15.8565 26.6444 16.3948 26.6665 16.941C26.6665 17.7743 26.7082 17.9827 26.7082 19.9993C26.7082 22.016 26.6665 22.2577 26.6665 23.0577H26.6165Z"
                          fill="white"
                        />
                      </svg>
                    </Link>
                  </div>
                </div>
                {/* powered by section */}
                <div className="mt-7 2xl:mt-9 flex space-x-2 xl:space-x-3">
                  <h1 className="lg:pt-[5px] xl:pt-[6px] 2xl:pt-[9px] text-sm lg:text-[16px] xl:text-xl 2xl:text-2xl font-medium text-white/50">
                    Powered By -
                  </h1>
                  {/* <div className=" lg:h-[26px] xl:h-[32px] 2xl:h-[40px]">
                <img src="/assets/fotter-logos/shurjo.png" alt="" className="h-full" />
              </div> */}
                  <div className="lg:h-[26px] xl:h-[32px] 2xl:h-[40px]">
                    <Image
                      src={`${process.env.NEXT_PUBLIC_STATIC_IMG_DOMAIN}/fotter-logos/shurjo.png`} // better: /assets/footer-logos/shurjo.png
                      alt="Shurjo"
                      width={160}
                      height={40}
                      className="h-full w-auto object-contain"
                      sizes="85px"
                    />
                  </div>
                </div>
                {/* photos */}
                <div className="flex md:gap-[3px] flex-wrap mt-3 2xl:mt-4">
                  {shurjoPayData?.map((img, i) => (
                    <div
                      key={i}
                      className="rounded-[5px] bg-[#5A5A5B] p-0 md:p-[2px] flex items-center justify-center 
                   lg:w-[32px] lg:h-[32px]
                  xl:w-[42px] xl:h-[42px]
                  2xl:w-[52px] 2xl:h-[52px]"
                    >
                      <div
                        className="relative lg:w-[28px] lg:h-[28px] 
                    xl:w-[36px] xl:h-[36px] 
                    2xl:w-[45px] 2xl:h-[45px] "
                      >
                        <Image
                          fill
                          src={img?.image}
                          alt="pay-icon"
                          className="object-contain"
                          sizes="(max-width:1023px) 32px, (max-width:1279px) 32px, (max-width:1535px) 42px, 52px"
                        />
                      </div>
                    </div>
                  ))}
                </div>
              </div>
            </div>
          </div>
        </div>
      )}
    </>
  )
}

export default Footer
